<a href="https://colab.research.google.com/github/rohandawar/pandaspractise/blob/main/Understanding_index.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
#import libs
import pandas as pd
import numpy as np

In [2]:
#load the data
col = ['age','workclass','fnlwgt', 'education', 'education_num','marital_status','occupation','relationship','race','sex','capital_gain','capital_loss', 'hours_per_week', 'native_country','label']
adult = pd.read_csv("https://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data", names = col, index_col=False)
adult.head()

   age          workclass  fnlwgt  ... hours_per_week  native_country   label
0   39          State-gov   77516  ...             40   United-States   <=50K
1   50   Self-emp-not-inc   83311  ...             13   United-States   <=50K
2   38            Private  215646  ...             40   United-States   <=50K
3   53            Private  234721  ...             40   United-States   <=50K
4   28            Private  338409  ...             40            Cuba   <=50K

[5 rows x 15 columns]

In [3]:
print('Shape of the data: ', adult.shape)
print('Number of Rows: ', adult.shape[0])
print('Number of Columns: ', adult.shape[1])

Shape of the data:  (32561, 15)
Number of Rows:  32561
Number of Columns:  15

In [4]:
#taking 10000 sample out of 32561
df = adult.sample(n = 10000, random_state=100).sort_index(axis = 0)
df.head()

    age   workclass  fnlwgt  ... hours_per_week  native_country   label
3    53     Private  234721  ...             40   United-States   <=50K
4    28     Private  338409  ...             40            Cuba   <=50K
6    49     Private  160187  ...             16         Jamaica   <=50K
8    31     Private   45781  ...             50   United-States    >50K
11   30   State-gov  141297  ...             40           India    >50K

[5 rows x 15 columns]

In [5]:
df.index

Int64Index([    3,     4,     6,     8,    11,    12,    16,    23,    26,
               29,
            ...
            32525, 32526, 32529, 32536, 32541, 32542, 32543, 32548, 32550,
            32556],
           dtype='int64', length=10000)

In [6]:
df.columns

Index(['age', 'workclass', 'fnlwgt', 'education', 'education_num',
       'marital_status', 'occupation', 'relationship', 'race', 'sex',
       'capital_gain', 'capital_loss', 'hours_per_week', 'native_country',
       'label'],
      dtype='object')

## Loc & Iloc examples

In [7]:
#example #1: Select third row & age value
#df.loc[2,['age']] # would give an error as #2 is not present in the df dataframe.
df.loc[3,['age']]

age    53
Name: 3, dtype: object

In [8]:
#Example #2 select 3rd row & age value
df.iloc[2,0] # 2 = row & 0 = columns

49

In [9]:
# dorpping some columns to keep things simple
cols_to_keep = ['age', 'education', 'marital_status', 'occupation', 'race', 'sex', 'native_country', 'label']
df = df[cols_to_keep]
df.head()

    age   education          marital_status  ...      sex  native_country   label
3    53        11th      Married-civ-spouse  ...     Male   United-States   <=50K
4    28   Bachelors      Married-civ-spouse  ...   Female            Cuba   <=50K
6    49         9th   Married-spouse-absent  ...   Female         Jamaica   <=50K
8    31     Masters           Never-married  ...   Female   United-States    >50K
11   30   Bachelors      Married-civ-spouse  ...     Male           India    >50K

[5 rows x 8 columns]

*Some of the times, it’s difficult to work with random numbers in index, at that time, resetting this index will make it a column and recreate another default index*

In [10]:
df.reset_index().head()

   index  age   education  ...      sex  native_country   label
0      3   53        11th  ...     Male   United-States   <=50K
1      4   28   Bachelors  ...   Female            Cuba   <=50K
2      6   49         9th  ...   Female         Jamaica   <=50K
3      8   31     Masters  ...   Female   United-States    >50K
4     11   30   Bachelors  ...     Male           India    >50K

[5 rows x 9 columns]

In [11]:
df.reset_index(drop=True).head()

   age   education          marital_status  ...      sex  native_country   label
0   53        11th      Married-civ-spouse  ...     Male   United-States   <=50K
1   28   Bachelors      Married-civ-spouse  ...   Female            Cuba   <=50K
2   49         9th   Married-spouse-absent  ...   Female         Jamaica   <=50K
3   31     Masters           Never-married  ...   Female   United-States    >50K
4   30   Bachelors      Married-civ-spouse  ...     Male           India    >50K

[5 rows x 8 columns]

In [12]:
df.head()

    age   education          marital_status  ...      sex  native_country   label
3    53        11th      Married-civ-spouse  ...     Male   United-States   <=50K
4    28   Bachelors      Married-civ-spouse  ...   Female            Cuba   <=50K
6    49         9th   Married-spouse-absent  ...   Female         Jamaica   <=50K
8    31     Masters           Never-married  ...   Female   United-States    >50K
11   30   Bachelors      Married-civ-spouse  ...     Male           India    >50K

[5 rows x 8 columns]

In [13]:
df.reset_index(inplace=True)
df.head()

   index  age   education  ...      sex  native_country   label
0      3   53        11th  ...     Male   United-States   <=50K
1      4   28   Bachelors  ...   Female            Cuba   <=50K
2      6   49         9th  ...   Female         Jamaica   <=50K
3      8   31     Masters  ...   Female   United-States    >50K
4     11   30   Bachelors  ...     Male           India    >50K

[5 rows x 9 columns]

In [14]:
#filtering on Ind
ind = df[df['native_country'] == ' India'] # there is space in space
ind.head() # we can see the index from df tagged along here.

      index  age   education  ...      sex native_country   label
4        11   30   Bachelors  ...     Male          India    >50K
312    1029   48     Masters  ...     Male          India   <=50K
637    2130   28        11th  ...   Female          India   <=50K
902    2989   44     Masters  ...     Male          India   <=50K
1365   4480   30   Bachelors  ...     Male          India   <=50K

[5 rows x 9 columns]

In [15]:
cross = pd.crosstab(ind.sex, ind.label)
cross

label     <=50K   >50K
sex
 Female       4      0
 Male        16     17

In [16]:
#filter with people earning more than 50k india
ind_50 = ind[ind.label == ' >50K']
ind_50.head()

      index  age     education  ...    sex native_country  label
4        11   30     Bachelors  ...   Male          India   >50K
2467   8124   36   Prof-school  ...   Male          India   >50K
3063   9939   43   Prof-school  ...   Male          India   >50K
3265  10590   35   Prof-school  ...   Male          India   >50K
3285  10661   59   Prof-school  ...   Male          India   >50K

[5 rows x 9 columns]

In [19]:
ind_50.columns

Index(['index', 'age', 'education', 'marital_status', 'occupation', 'race',
       'sex', 'native_country', 'label'],
      dtype='object')

In [20]:
#getting hours_per_week from adults dataset
adult['hours_per_week'][ind_50['index']]

11       40
8124     40
9939     50
10590    40
10661    40
13551    40
16923    60
17834    50
21128    50
24154    50
25739    40
26356    40
28264    70
28433    55
28452    40
28798    50
31327    60
Name: hours_per_week, dtype: int64